/**********************************
作者：单片机俱乐部
网站：https://www.mcuclub.cn/
**********************************/


#ifndef _HC_SR04_H_
#define _HC_SR04_H_

/**********************************
包含头文件
**********************************/
#include "main.h"


/**********************************
PIN口定义
**********************************/
sbit HCSR04_Trig = P3^6;												// 超声波模块的Trig引脚
sbit HCSR04_Echo = P3^7;												// 超声波模块的Echo引脚


/**********************************
函数声明
**********************************/
uint Hcsr04_GetDistance(uint Hcsr04_temp);			//超声波获取距离值(距离单位cm)


#endif

