/**********************************
作者：单片机俱乐部
网站：https://www.mcuclub.cn/
**********************************/


#ifndef _KEY_H_
#define _KEY_H_


/**********************************
包含头文件
**********************************/
#include "main.h"


/**********************************
PIN口定义
**********************************/
sbit KEY1=P2^2;																		//独立按键KEY1引脚
sbit KEY2=P2^3;																		//独立按键KEY2引脚
sbit KEY3=P2^4;																		//独立按键KEY3引脚


/**********************************
函数声明
**********************************/
uchar Chiclet_Keyboard_Scan(uchar key_mode);			//独立按键扫描函数


#endif

