/**********************************
作者：单片机俱乐部
网站：https://www.mcuclub.cn/
**********************************/


/**********************************
包含头文件
**********************************/
#include "timer.h"


/**********************************
变量定义
**********************************/
bit flag_timer_begin = 0;								//计时开始标志位
bit flag_1s = 0;												//定时1s完成标志位


/**********************************
函数定义
**********************************/
/****
*******定时器0初使化函数
*****/
void Timer0_Init(void)
{
	TMOD &= 0xF0;  												//清零 T0 的控制位
	TMOD |= 0x01;  												//配置 T0 为模式 1
	TH0 = (65535-9216)/256; 							//配置 T0 重载值
	TL0 = (65535-9216)%256; 							//初值等于重载值

	TR0 = 1; 															//启动 T0
	ET0 = 1; 															//启动 T0 中断
	EA = 1;																//打开总中断
}

/****
*******T0计时中断函数

	1s的定时次数= 1/(12/11059200)=921600,16位计数器最大可计数65536次，所以通常定时ms为单位，比如定时10ms，则循环100次为1s，则计数次数为921600/100=9216，则初值为
	TH0 = (65535-9216)/256;  //重新赋初值
	TL0 = (65535-9216)%256;
*****/
void Timer0_Handler(void) interrupt 1    //0：外部中断1的中断号； 1：定时器0的中断号； 2 外部中断2的中断号； 3：为定时器1的中断号； 4 串口中断的中断号；
{
	static uint timer0_count;

	TH0 = (65535-9216)/256;  							//重新赋初值
	TL0 = (65535-9216)%256;

	if(flag_timer_begin == 1)							//开始计时
	{
		timer0_count ++;
		if(timer0_count >= 100)  						//定时1s
		{
			timer0_count = 0;
			flag_1s = 1;
		}
	}
	else
	{
		timer0_count = 0;
		flag_1s = 0;
	}
}

